'''
«Поиск выбросов – 1»

Мы попросили 100 человек написать на бумажке свой рост и кинуть в коробку. 
После занесли эти данные в список, из которого сделали pd.Series для удобства расчётов.
Рассчитайте базовые статистики (среднее, медиану, моду), 
межквартильный размах и найдите выбросы.
ВАЖНО: ВЫБРОСЫ ТРЕБУЕТСЯ ВЕРНУТЬ В ВИДЕ СПИСКА.

Код для студента:

import pandas as pd

height = [154, 185, 170, 184, 175, 180, 187, 164, 178, 185, 
          157, 179, 183, 159, 178, 189, 172, 167, 163, 166,
          156, 165, 181, 164, 171, 185, 171, 168, 161, 184,
          178, 161, 184, 150, 168, 187, 175, 175, 174, 154,
          180, 164, 163, 163, 165, 185, 161, 166, 163, 171,
          163, 184, 160, 161, 155, 185, 152, 169, 178, 154,
          188, 158, 177, 250, 190, 189, 163, 168, 158, 182,
          165, 67, 166, 167, 188, 185, 182, 172, 162, 156,
          175, 184, 171, 174, 153, 154, 151, 176, 179, 161,
          175, 154, 167, 180, 186, 174, 188, 176, 160, 179]

h = pd.Series(height)

mean = ...
median = ...
mode = ...
iqr = ...
lower_bound = ...
upper_bound = ...
outliers = ...

print(mean, median, mode, iqr, outliers, sep='\n')
'''

# Код эксперта:

import pandas as pd

height = [154, 185, 170, 184, 175, 180, 187, 164, 178, 185, 
          157, 179, 183, 159, 178, 189, 172, 167, 163, 166,
          156, 165, 181, 164, 171, 185, 171, 168, 161, 184,
          178, 161, 184, 150, 168, 187, 175, 175, 174, 154,
          180, 164, 163, 163, 165, 185, 161, 166, 163, 171,
          163, 184, 160, 161, 155, 185, 152, 169, 178, 154,
          188, 158, 177, 250, 190, 189, 163, 168, 158, 182,
          165, 67, 166, 167, 188, 185, 182, 172, 162, 156,
          175, 184, 171, 174, 153, 154, 151, 176, 179, 161,
          175, 154, 167, 180, 186, 174, 188, 176, 160, 179]

h = pd.Series(height)

mean = h.mean()
median = h.median()
mode = h.mode()[0]
iqr = h.quantile(0.75) - h.quantile(0.25)
lower_bound = h.quantile(0.25) - (1.5 * iqr)
upper_bound = h.quantile(0.75) + (1.5 * iqr)
# поиск выбросов с помощью List Comprehension:
outliers = [x for x in h if x > upper_bound or x < lower_bound]
# поиск выбросов методами pandas:
outliers = (h.to_frame()[~h.between(lower_bound, upper_bound)]
            .squeeze()
            .to_list())

print(mean, median, mode, iqr, outliers, sep='\n')

'''
Правильный ответ:

170.79
171.0
163
17.5
[250, 67]
'''