'''
«Поиск выбросов – 2»

Статист Порфирий Петрович скучал на работе и решил установить 
датчик кликов на выключатель в уборной своего офиса. 
Спустя 60 дней он снял показания и проанализировал данные.
Вместе с Порфирием Петровичем рассчитайте базовые статистики:
среднее (округлить до целого), 
медиану, 
моду, 
межквартильный размах,
найдите выбросы.
ВАЖНО: ВЫБРОСЫ ТРЕБУЕТСЯ ВЕРНУТЬ В ВИДЕ СПИСКА.

Код для студента:

import pandas as pd

clicks = [140, 228, 252, 261, 79, 2, 0, 26, 136, 148,
          183, 102, 0, 0, 242, 105, 266, 147, 286, 7,
          2, 183, 221, 9999, 31, 57, 0, 0, 100, 111,
          188, 123, 253, 3, 0, 299, 100, 210, 264, 12,
          0, 119, 0, 264, 124, 155, 0, 88, 147, 210,
          104, 52, 165, 2, 1, 192, 162, 109, 186, 17]

cl = pd.Series(clicks)

mean = ...
median = ...
mode = ...
iqr = ...
lower_bound = ...
upper_bound = ...
outliers = ...

print(mean, median, mode, iqr, outliers, sep='\n')
'''

# Код эксперта:

import pandas as pd

clicks = [140, 228, 252, 261, 79, 2, 0, 26, 136, 148,
          183, 102, 0, 0, 242, 105, 266, 147, 286, 7,
          2, 183, 221, 9999, 31, 57, 0, 0, 100, 111,
          188, 123, 253, 3, 0, 299, 100, 210, 264, 12,
          0, 119, 0, 264, 124, 155, 0, 88, 147, 210,
          104, 52, 165, 2, 1, 192, 162, 109, 186, 17]

cl = pd.Series(clicks)

mean = round(cl.mean())
median = cl.median()
mode = cl.mode()[0]
iqr = cl.quantile(0.75) - cl.quantile(0.25)
lower_bound = cl.quantile(0.25) - (1.5 * iqr)
upper_bound = cl.quantile(0.75) + (1.5 * iqr)
# поиск выбросов с помощью List Comprehension:
outliers = [x for x in cl if x > upper_bound or x < lower_bound]
# поиск выбросов методами pandas:
outliers = [(cl.to_frame()[~cl.between(lower_bound, upper_bound)]
            .squeeze())]

print(mean, median, mode, iqr, outliers, sep='\n')

'''
Правильный ответ:

281
115.0
0
178.25
[9999]
'''