'''
«Расчёт базовых статистик – 1»

В классе 40 студентов. Они написали тест, который оценили по 100-бальной системе. 
Ниже приведён список оценок и для удобства расчётов преобразован в pd.Series.

Рассчитайте базовые статистики:
максимальную величину,
минимальную величину,
размах, 
дисперсию (округлить до целого), 
среднее, 
медиану,
моду (приведите к int).


Код для студента:

import pandas as pd

grades = [87, 80, 99, 90, 74, 100, 95, 90, 56, 95,
          75, 5, 85, 78, 30, 77, 70, 59, 88, 100,
          50, 69, 97, 96, 82, 21, 46, 93, 72, 95, 
          60, 91, 52, 27, 63, 66, 85, 59, 91, 76]
sr = pd.Series(grades)

min_ = ...
max_ = ...
range_ = ...
disp = ...
mean = ...
median = ...
mode = ...
print(min_, max_, range_, disp, mean, median, mode, sep='\n')
'''

# Код эксперта:

import pandas as pd

grades = [87, 80, 99, 90, 74, 100, 95, 90, 56, 95,
          75, 5, 85, 78, 30, 77, 70, 59, 88, 100,
          50, 69, 97, 96, 82, 21, 46, 93, 72, 95, 
          60, 91, 52, 27, 63, 66, 85, 59, 91, 76]

sr = pd.Series(grades)

min_ = sr.min()
max_ = sr.max()
range_ = max_ - min_
disp = round(sr.var())
mean = sr.mean()
median = sr.median()
mode = int(sr.mode()[0])
print(min_, max_, range_, disp, mean, median, mode, sep='\n')

'''
Правильный ответ:
5
100
95
544
73.1
77.5
95
'''